scripts/benchmark-exp-logs/social-network/social-network-jaeger-benchmark-2-20.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 20 connections
  Thread calibration: mean lat.: 3648.778ms, rate sampling interval: 12910ms
  Thread calibration: mean lat.: 3678.145ms, rate sampling interval: 13148ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    15.68s     4.24s   22.02s    64.66%
    Req/Sec     2.69k    82.12     2.79k    33.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   17.30s 
 75.000%   18.96s 
 90.000%   20.22s 
 99.000%   22.02s 
 99.900%   22.41s 
 99.990%   22.51s 
 99.999%   22.54s 
100.000%   22.56s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5746.687     0.000000            1         1.00
    8855.551     0.100000        27010         1.11
   10813.439     0.200000        53867         1.25
   13385.727     0.300000        80695         1.43
   15818.751     0.400000       107657         1.67
   17301.503     0.500000       134741         2.00
   17694.719     0.550000       148150         2.22
   18022.399     0.600000       161875         2.50
   18317.311     0.650000       175009         2.86
   18628.607     0.700000       188787         3.33
   18956.287     0.750000       202168         4.00
   19152.895     0.775000       208849         4.44
   19365.887     0.800000       215559         5.00
   19562.495     0.825000       222102         5.71
   19759.103     0.850000       228628         6.67
   20004.863     0.875000       235770         8.00
   20103.167     0.887500       238967         8.89
   20217.855     0.900000       242170        10.00
   20348.927     0.912500       245416        11.43
   20512.767     0.925000       248941        13.33
   20692.991     0.937500       252254        16.00
   20774.911     0.943750       253869        17.78
   20856.831     0.950000       255561        20.00
   20938.751     0.956250       257351        22.86
   21020.671     0.962500       258863        26.67
   21151.743     0.968750       260673        32.00
   21233.663     0.971875       261440        35.56
   21315.583     0.975000       262222        40.00
   21430.271     0.978125       263119        45.71
   21561.343     0.981250       263905        53.33
   21741.567     0.984375       264786        64.00
   21823.487     0.985938       265173        71.11
   21905.407     0.987500       265618        80.00
   21970.943     0.989062       265988        91.43
   22036.479     0.990625       266403       106.67
   22102.015     0.992188       266879       128.00
   22134.783     0.992969       267153       142.22
   22151.167     0.993750       267284       160.00
   22183.935     0.994531       267515       182.86
   22216.703     0.995313       267723       213.33
   22249.471     0.996094       267905       256.00
   22265.855     0.996484       267981       284.44
   22298.623     0.996875       268169       320.00
   22315.007     0.997266       268259       365.71
   22331.391     0.997656       268332       426.67
   22347.775     0.998047       268400       512.00
   22364.159     0.998242       268467       568.89
   22380.543     0.998437       268533       640.00
   22396.927     0.998633       268598       731.43
   22396.927     0.998828       268598       853.33
   22413.311     0.999023       268657      1024.00
   22429.695     0.999121       268715      1137.78
   22429.695     0.999219       268715      1280.00
   22446.079     0.999316       268771      1462.86
   22446.079     0.999414       268771      1706.67
   22462.463     0.999512       268816      2048.00
   22462.463     0.999561       268816      2275.56
   22462.463     0.999609       268816      2560.00
   22478.847     0.999658       268857      2925.71
   22478.847     0.999707       268857      3413.33
   22478.847     0.999756       268857      4096.00
   22478.847     0.999780       268857      4551.11
   22495.231     0.999805       268883      5120.00
   22495.231     0.999829       268883      5851.43
   22495.231     0.999854       268883      6826.67
   22495.231     0.999878       268883      8192.00
   22511.615     0.999890       268900      9102.22
   22511.615     0.999902       268900     10240.00
   22511.615     0.999915       268900     11702.86
   22511.615     0.999927       268900     13653.33
   22511.615     0.999939       268900     16384.00
   22511.615     0.999945       268900     18204.44
   22511.615     0.999951       268900     20480.00
   22527.999     0.999957       268906     23405.71
   22527.999     0.999963       268906     27306.67
   22527.999     0.999969       268906     32768.00
   22527.999     0.999973       268906     36408.89
   22544.383     0.999976       268910     40960.00
   22544.383     0.999979       268910     46811.43
   22544.383     0.999982       268910     54613.33
   22544.383     0.999985       268910     65536.00
   22544.383     0.999986       268910     72817.78
   22544.383     0.999988       268910     81920.00
   22560.767     0.999989       268913     93622.86
   22560.767     1.000000       268913          inf
#[Mean    =    15683.278, StdDeviation   =     4242.551]
#[Max     =    22544.384, Total count    =       268913]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  323655 requests in 1.00m, 61.42MB read
  Socket errors: connect 0, read 0, write 0, timeout 24
Requests/sec:   5394.14
Transfer/sec:      1.02MB