scripts/benchmark-exp-logs/social-network/social-network-no-tracing-benchmark-2-14.log
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/user-timeline/read
  2 threads and 14 connections
  Thread calibration: mean lat.: 2265.037ms, rate sampling interval: 6914ms
  Thread calibration: mean lat.: 2259.206ms, rate sampling interval: 6823ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.16s   404.25ms   3.95s    63.36%
    Req/Sec     4.75k   128.99     5.00k    64.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.18s 
 75.000%    3.47s 
 90.000%    3.67s 
 99.000%    3.95s 
 99.900%    4.11s 
 99.990%    4.19s 
 99.999%    4.24s 
100.000%    4.24s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    2021.375     0.000000            1         1.00
    2594.815     0.100000        47528         1.11
    2770.943     0.200000        94878         1.25
    2922.495     0.300000       142935         1.43
    3057.663     0.400000       190022         1.67
    3184.639     0.500000       237268         2.00
    3246.079     0.550000       261356         2.22
    3305.471     0.600000       285362         2.50
    3362.815     0.650000       309035         2.86
    3418.111     0.700000       332605         3.33
    3473.407     0.750000       355710         4.00
    3504.127     0.775000       367768         4.44
    3534.847     0.800000       379611         5.00
    3565.567     0.825000       391263         5.71
    3598.335     0.850000       403265         6.67
    3633.151     0.875000       414987         8.00
    3653.631     0.887500       421425         8.89
    3672.063     0.900000       426909        10.00
    3692.543     0.912500       432710        11.43
    3717.119     0.925000       439023        13.33
    3743.743     0.937500       444790        16.00
    3758.079     0.943750       447573        17.78
    3774.463     0.950000       450529        20.00
    3792.895     0.956250       453600        22.86
    3813.375     0.962500       456671        26.67
    3833.855     0.968750       459421        32.00
    3846.143     0.971875       460914        35.56
    3860.479     0.975000       462522        40.00
    3874.815     0.978125       464006        45.71
    3891.199     0.981250       465465        53.33
    3909.631     0.984375       466877        64.00
    3919.871     0.985938       467587        71.11
    3932.159     0.987500       468337        80.00
    3944.447     0.989062       469018        91.43
    3958.783     0.990625       469762       106.67
    3977.215     0.992188       470550       128.00
    3985.407     0.992969       470870       142.22
    3995.647     0.993750       471258       160.00
    4005.887     0.994531       471620       182.86
    4018.175     0.995313       472026       213.33
    4030.463     0.996094       472403       256.00
    4036.607     0.996484       472578       284.44
    4042.751     0.996875       472728       320.00
    4050.943     0.997266       472917       365.71
    4059.135     0.997656       473091       426.67
    4071.423     0.998047       473301       512.00
    4077.567     0.998242       473396       568.89
    4083.711     0.998437       473479       640.00
    4089.855     0.998633       473553       731.43
    4100.095     0.998828       473657       853.33
    4108.287     0.999023       473739      1024.00
    4114.431     0.999121       473790      1137.78
    4120.575     0.999219       473841      1280.00
    4126.719     0.999316       473886      1462.86
    4132.863     0.999414       473937      1706.67
    4139.007     0.999512       473977      2048.00
    4143.103     0.999561       474003      2275.56
    4145.151     0.999609       474017      2560.00
    4149.247     0.999658       474043      2925.71
    4153.343     0.999707       474061      3413.33
    4161.535     0.999756       474090      4096.00
    4163.583     0.999780       474097      4551.11
    4167.679     0.999805       474109      5120.00
    4171.775     0.999829       474119      5851.43
    4175.871     0.999854       474131      6826.67
    4182.015     0.999878       474144      8192.00
    4184.063     0.999890       474148      9102.22
    4188.159     0.999902       474156     10240.00
    4190.207     0.999915       474161     11702.86
    4192.255     0.999927       474165     13653.33
    4198.399     0.999939       474171     16384.00
    4202.495     0.999945       474173     18204.44
    4206.591     0.999951       474176     20480.00
    4210.687     0.999957       474179     23405.71
    4214.783     0.999963       474182     27306.67
    4218.879     0.999969       474185     32768.00
    4222.975     0.999973       474188     36408.89
    4222.975     0.999976       474188     40960.00
    4227.071     0.999979       474190     46811.43
    4231.167     0.999982       474193     54613.33
    4231.167     0.999985       474193     65536.00
    4231.167     0.999986       474193     72817.78
    4235.263     0.999988       474196     81920.00
    4235.263     0.999989       474196     93622.86
    4235.263     0.999991       474196    109226.67
    4235.263     0.999992       474196    131072.00
    4235.263     0.999993       474196    145635.56
    4239.359     0.999994       474199    163840.00
    4239.359     1.000000       474199          inf
#[Mean    =     3157.679, StdDeviation   =      404.246]
#[Max     =     4235.264, Total count    =       474199]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  570860 requests in 1.00m, 108.34MB read
Requests/sec:   9514.41
Transfer/sec:      1.81MB